Revit 2026 API

# EnergyDataSettingsGetBuildingConstructionSetElementId Method

---

Id of the building construction set.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ElementId GetBuildingConstructionSetElementId(
	Document ccda
)
```
```vb
Public Shared Function GetBuildingConstructionSetElementId (
	ccda As Document
) As ElementId
```
```cpp
public:
static ElementId^ GetBuildingConstructionSetElementId(
	Document^ ccda
)
```
```fsharp
static member GetBuildingConstructionSetElementId :
        ccda : Document -> ElementId
```

#### Parameters

ccda Document

#### Return Value

ElementId Returns the id of the building construction set.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The building construction set is the default project construction set used when spaces are not assigned a construction.

#### Reference

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace